## Combining data sets :Merge and Join

#### Joining two pandas dataframe using merge()

Example 1 : Merging two Dataframe with same number of elements :

In [1]:
 import pandas as pd 
 
df1 = pd.DataFrame({"fruit" : ["apple", "banana", "avocado"], 
					"market_price" : [21, 14, 35]}) 
display(df1) 

df2 = pd.DataFrame({"fruit" : ["banana", "apple", "avocado"], 
					"wholesaler_price" : [65, 68, 75]})  
display(df2) 

pd.merge(df1, df2, on = "fruit", how = "inner")

     fruit  market_price
0    apple            21
1   banana            14
2  avocado            35

     fruit  wholesaler_price
0   banana                65
1    apple                68
2  avocado                75

     fruit  market_price  wholesaler_price
0    apple            21                68
1   banana            14                65
2  avocado            35                75

Example 2 : Merging two Dataframe with different number of elements :

In [20]:
import pandas as pd 
 
df1 = pd.DataFrame({"fruit" : ["apple", "banana", "avocado", "grape"], 
					"market_price" : [21, 14, 35, 38]})  
display(df1) 
 
df2 = pd.DataFrame({"fruit" : ["apple", "banana", "grape"], 
					"wholesaler_price" : [65, 68, 71]})  
display(df2) 
 
pd.merge(df1, df2, on = "fruit", how = "inner") 
pd.merge(df1, df2, on = "fruit", how = "outer")
pd.merge(df1, df2, on = "fruit", how = "left")

     fruit  market_price
0    apple            21
1   banana            14
2  avocado            35
3    grape            38

    fruit  wholesaler_price
0   apple                65
1  banana                68
2   grape                71

    fruit  market_price  wholesaler_price
0   apple            21                65
1  banana            14                68
2   grape            38                71

In [18]:
pd.merge(df1, df2, on = "fruit", how = "outer")

     fruit  market_price  wholesaler_price
0    apple            21              65.0
1  avocado            35               NaN
2   banana            14              68.0
3    grape            38              71.0

In [14]:
pd.merge(df1, df2, on = "fruit", how = "left")

     fruit  market_price  wholesaler_price
0    apple            21              65.0
1   banana            14              68.0
2  avocado            35               NaN
3    grape            38              71.0

In [22]:
pd.merge(df1,df2, on = "fruit" , how = "right")

    fruit  market_price  wholesaler_price
0   apple            21                65
1  banana            14                68
2   grape            38                71

### Catergories of Join

#### one-to-one joins

In [3]:
df1 = pd.DataFrame({"fruit" : ["apple", "banana", "avocado", "grape"], 
					"market_price" : [60, 90, 150, 80]})
df2 = pd.DataFrame({"fruit" : ["banana", "apple", "grape", "avocado"],
                    "wholesale_price" : [30,45,40,100]})
df1

     fruit  market_price
0    apple            60
1   banana            90
2  avocado           150
3    grape            80

In [44]:
df2

     fruit  wholesale_price
0   banana               30
1    apple               45
2    grape               40
3  avocado              100

In [46]:
df3 = pd.merge(df1, df2)
df3

     fruit  market_price  wholesale_price
0    apple            60               45
1   banana            90               30
2  avocado           150              100
3    grape            80               40

* In pandas, a one-to-one join is a type of merge operation where each row in one DataFrame matches exactly one row in another DataFrame based on a key column. This is commonly used when you have two datasets where each key is unique in both DataFrames.

In [76]:
f1 = pd.DataFrame({'id': [1,2,3] , 'name' : [ 'Arya', 'Anu', 'Avani']})
f2 = pd.DataFrame({'id' : [1,2,3] , 'age' : [22 ,21, 23]})
merged_df = pd.merge(f1,f2,on = 'id')
merged_df

   id   name  age
0   1   Arya   22
1   2    Anu   21
2   3  Avani   23

on='id' specifies that the join should be performed on the 'id' column.

#### EXAMPLE_1

In [131]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],'hire_date': [2004, 2008, 2012, 2014]})
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],'supervisor': ['Carly', 'Guido', 'Steve']})

In [133]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [135]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [137]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

* MANY_TO_ONE

In [141]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],'supervisor': ['Carly', 'Guido', 'Steve']})

In [143]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [145]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [147]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

#### EXAMPLE_2

#### Many-to-ones joins

In [149]:
import pandas as pd
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
display(df1,df2)
display(pd.merge(df3, df4))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

#### many-to-many joins

In [151]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
display('df1', 'df5', "pd.merge(df1, df5)")

'df1'

'df5'

'pd.merge(df1, df5)'

In [153]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [155]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [157]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### Specification of the merge key

#### The on keyword

In [161]:
display('df1', 'df2', "pd.merge(df1, df2, on='employee')")

'df1'

'df2'

"pd.merge(df1, df2, on='employee')"

In [167]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [171]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [173]:
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### The left_on and right_on keyword

In [175]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
display('df1', 'df3', 'pd.merge(df1, df3, left_on="employee", right_on="name")')

'df1'

'df3'

'pd.merge(df1, df3, left_on="employee", right_on="name")'

In [177]:
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [179]:
pd.merge(df1, df3, left_on="employee", right_on="name")

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

### The ``left_index`` and ``right_index`` keywords

In [123]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')

'df1a'

'df2a'

In [181]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [183]:
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [185]:
display('df1a', 'df2a',
        "pd.merge(df1a, df2a, left_index=True, right_index=True)")

'df1a'

'df2a'

'pd.merge(df1a, df2a, left_index=True, right_index=True)'

In [187]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [189]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [191]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [195]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [197]:
display('df1a', 'df3', "pd.merge(df1a, df3, left_index=True, right_on='name')")

'df1a'

'df3'

"pd.merge(df1a, df3, left_index=True, right_on='name')"

In [199]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [201]:
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [205]:
pd.merge(df1a, df3, left_index=True, right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

## Specifying Set Arithmetic for Joins

In [208]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
display('df6', 'df7', 'pd.merge(df6, df7)')

'df6'

'df7'

'pd.merge(df6, df7)'

In [210]:
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [212]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [214]:
pd.merge(df6, df7)

   name   food drink
0  Mary  bread  wine

In [216]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [218]:
pd.merge(df6, df7, how='outer')

     name   food drink
0  Joseph    NaN  beer
1    Mary  bread  wine
2    Paul  beans   NaN
3   Peter   fish   NaN

In [220]:
pd.merge(df6, df7, how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

## Overlapping Column Names: The ``suffixes`` Keyword

In [223]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})
display('df8', 'df9', 'pd.merge(df8, df9, on="name")')

'df8'

'df9'

'pd.merge(df8, df9, on="name")'

In [225]:
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [227]:
df9

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [229]:
pd.merge(df8, df9, on="name")

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [231]:
pd.merge(df8, df9, on="rank", suffixes=["_L", "_R"])

  name_L  rank name_R
0    Bob     1   Jake
1   Jake     2    Sue
2   Lisa     3    Bob
3    Sue     4   Lisa